[{"model": "products.category", "pk": 1, "fields": {"name": "greystones_the_way_it_was", "friendly_name": "Greystones: The Way It Was"}}, {"model": "products.category", "pk": 2, "fields": {"name": "greystones_today", "friendly_name": "Greystones: Today"}}, {"model": "products.category", "pk": 3, "fields": {"name": "greystones_timeless", "friendly_name": "Greystones: Timeless"}}, {"model": "products.category", "pk": 4, "fields": {"name": "other_beautiful_places", "friendly_name": "Other Beautiful Places"}}, {"model": "products.size", "pk": 2, "fields": {"name": "A3", "price": "44.00"}}, {"model": "products.size", "pk": 3, "fields": {"name": "card", "price": "3.00"}}, {"model": "products.size", "pk": 4, "fields": {"name": "A4", "price": "40.00"}}, {"model": "products.product", "pk": 1, "fields": {"category": 1, "name": "Childhood Memories, to the South Beach arch, Co Wicklow, Ireland", "description": "Childhood Memories - To the south beach arch, Greystones, Co. Wicklow, Ireland\r\n\r\nThe person who commissioned this painting wanted to capture a childhood memory of going for a swim. I worked from a photo taken recently and asked her how she remembered it. I omitted the modern parts of the photo and painted in the bits as she remembered, consulting with her throughout. I used glass gems for the flowers to bring a bit of magic to the finished product. I have painted a similar scene for another client, and one with boys on bikes for two other clients I LOVE this scene, full of anticipation about what beach we will swim in!\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "child_memories.jpg", "sizes": []}}, {"model": "products.product", "pk": 2, "fields": {"category": 1, "name": "Rush to the Raft at Greystones Men's, Co. Wicklow, Ireland", "description": "Rush to the Raft at Greystones Men's, Co. Wicklow, Ireland\r\n\r\nEvery summer a raft magically appeared, perfectly positioned so we could jump off the diving board and swim out to it. It was many, many years before we realised that a very kind gentleman who lived directly opposite the Men's organised, funded and liaised with the council to make this possible, giving us youngsters a perfect summer. Thanks Mr Davy! I used about four different photos to create this painting. I have painted it a few times, and it is in homes in Greystones and Dublin.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "rush_to_the_rafts.jpg", "sizes": []}}, {"model": "products.product", "pk": 3, "fields": {"category": 1, "name": "Summer fun at Greystones Men's, Co. Wicklow, Ireland", "description": "Summer fun at Greystones Men's, Co. Wicklow, Ireland\r\n\r\nThis painting depicts summer days at the Men's in the last few years before it disappeared under a mountain of sand. This painting keeps those days and memories alive, and hangs in a local home.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Summer_fun_at_The-Mens_Greystones_Seafront.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 4, "fields": {"category": 1, "name": "The Way it was, Greystones Men's 2003, Co, Wicklow, Ireland", "description": "The Way it was, Greystones Men's 2003, Co. Wicklow, Ireland\r\n\r\nI painted this from a photo taken on the same day as 'When we we were young'. When you stood at the top of the steps you had no idea what was on the other side of the wall. It always felt calm and serene, unable to answer our questions until we descended the steps, past the hebe bushes and yucca plants and looked over the wall. Then we could see if the tide was in, if we could dive off the board, swim out to the raft, and see who else was there to hang out with.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "The_way_it_was__Greystones_Seafront_2006.jpg", "sizes": [2, 3]}}, {"model": "products.product", "pk": 5, "fields": {"category": 1, "name": "Time to Think, Greystones seafront, Co. Wicklow, Ireland", "description": "Time to Think - Greystones seafront, Co. Wicklow, Ireland\r\n\r\nI painted this commission from a photo taken in 2006. Whilst the seating along the seafront has changed greatly, this special view is timeless. I felt so at peace while painting it I use it on my banner for my Etsy shop. It is loved by the person who commissioned it.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Time_to_think_Greystones_Seafront_2004.jpg", "sizes": [2, 3]}}, {"model": "products.product", "pk": 6, "fields": {"category": 1, "name": "When we were young, Greystones Men's, Co Wicklow, Ireland", "description": "When we were young, Greystones Men's, Co. Wicklow, Ireland\r\n\r\nPainted from a photo taken in 2003, this commission captures all that is special about The Men's in winter. Strong colours of sky and sea with crashing waves making it totally unswimmable. I have painted it for quite a few people and sold many prints of it. Originals hang in homes in Australia, Greystones and Dublin.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "When_we_were_young_Greystones_Mens_in_2006.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 7, "fields": {"category": 4, "name": "The Drummin Trees, Bellevue Hill, Delgany, Co Wicklow, Ireland", "description": "The Drummin Trees from Bellevue Hill, Delgany. Co. Wicklow, Ireland\r\n\r\nEveryone from Greystones, Delgany and most of Co Wicklow recognises these iconic trees letting you know you are nearing home. In fact, during the first world war when trees were being cut down for fuel, these trees escaped such fate as they were used as a navigation aid for pilots. I was commissioned to paint this stunning scene from Bellevue Hill, by someone who lives in Delgany and wanted the view captured inside as well as when out walking.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Drummin_Trees_from_Bellevue_Hill.jpg", "sizes": [2, 3]}}, {"model": "products.product", "pk": 8, "fields": {"category": 3, "name": "Gone for a swim. Greystones Men's, Co Wicklow, Ireland", "description": "Gone for a swim, Greystones Men's, Co. Wicklow, Ireland\r\n\r\nGrowing up in Greystones in the 1970s the Men's was the best place to swim when the tide was in. Mary Hackett had won her amazing battle to allow everyone to swim there (although it has still retained the name!). We would cycle along the seafront from the south beach, or from the harbour and cove, and quickly lean our bikes against the wall in a rush to see if the tide was perfect for diving off the board and swimming. An old friend commissioned this painting, and to bring it to life she and another friend retraced their steps parking their bikes where we would have put them. Sadly the diving board is buried under feet of sand for most of the year! I have painted this scene many times it evokes similar memories for others from a certain era.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Gone_for_a_swim_Greystones_mens.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 9, "fields": {"category": 3, "name": "Lost on a painted sky, Greystones South beach, Co Wicklow", "description": "Lost on a painted sky, winter storm at Greystone South beach, Co. Wicklow, Ireland\r\n\r\nWhen I was home just before the pandemic I took a photo of a stormy February day. I painted the scene using pointillism (making dots) for the sand and lots of glass gems to bring out the sparkle on the sea and sand. The painting hangs in a house in London.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Lost_on_a_painted_sky_Winter_at_Greystones-South_Beach.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 10, "fields": {"category": 3, "name": "Morning Glory, Wicklow mountains from Bray Head, Co, Wicklow, Ireland.", "description": "Behind the yellow rapeseed fields and woods sits Little Sugarloaf, then Great Sugarloaf, with Djouce at the back. Sitting at the top of Bray Head you have this glorious view looking west, with the sea to the north, east and south. What's not to love?!\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Morning_glory_View_from_the_top_of_Bray_Head.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 11, "fields": {"category": 3, "name": "Nearly There, On the train to Greystones, Co Wicklow, Ireland", "description": "Nearly There - on the train to Greystones, Co. Wicklow, Ireland\r\n\r\nThe coastal train ride from Dublin to Greystones is one of the top 10 things to do when visiting Ireland. The last leg of the journey from Bray to Greystones is truly spectacular. The railway line hugs the cliffs - a feat of engineering laid out by Isambard Kingdom Brunel in the 1850s. It cuts through tunnels before emerging into Greystones. As you enter the tunnels you know you were 'nearly there, nearly home. This special original painting hangs in my home as a gentle reminder of what is to come.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Nearly_there_Cliff_Walk_from_Bray_to_Greystones.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 12, "fields": {"category": 3, "name": "Walking the Walk, Bray - Greystones cliff walk, Co. Wicklow, Ireland", "description": "Walking the Walk- Bray to Greystones cliff walk, Co. Wicklow, Ireland\r\n\r\nThe 9km Bray to Greystones cliff walk was built in the 1800's to facilitate the men and materials constructing the train line below. It sits lies high above the railway tracks and follows the same route with the most glorious sea views and scenery. Covered in gorse and wild flowers it's a popular tourist attraction and a daily walk/run for many locals. I painted this scene and was delighted when Cafe Grey in Greystones bought it to display in their shop. It is a timeless and iconic view.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Walking_the_walk_Bray_to_Greystones_cliff_walk.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 13, "fields": {"category": 2, "name": "Perfectly Greystones. Cove and Sailing club, Co Wicklow, Ireland", "description": "Perfectly Greystones, the Cove and the Club, Co. Wicklow, Ireland\r\n\r\nThis was my very first painting, done in December 2018, so has a special place in my heart. When I come home to Greystones this is the first place I go, to look to Bray Head to the north, and the Men's and south beach to the south. What more could I want?\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist", "image_url": null, "image": "Perfectly_Greystones_The_Cove_and_Sailing_Club.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 14, "fields": {"category": 2, "name": "Rocky 'Stones, Greystones seafront, Co Wicklow, Ireland", "description": "Rocky 'Stones, Greystones seafront, Co. Wicklow, Ireland\r\n\r\nGreystones, as the name says, is all about the 'Stones. This iconic seafront view was bought for a 70th birthday present. I used the pointillism technique (small dots) to create texture in the rocks and the sand, and the afternoon sun casts shadows on the sand.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Rocky_Stones_Greystones_Seafront.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 15, "fields": {"category": 2, "name": "Safe and sound, Greystones harbour, Co. Wicklow, Ireland", "description": "Safe and sound, Greystones Harbour, Co. Wicklow, Ireland\r\n\r\nLove it or loath it, the new harbour is here to stay, so I wanted to show it off in its best light with the calm waters and blue skies. I used the pointallism technique (small dots) to create texture in the sand, and collage to create the pier. It hangs in a Spendloves coffee and ice cream shop.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Safe_and_Sound_Greystones_Harbour.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 16, "fields": {"category": 2, "name": "The view from my school, Greystones seafront, Co. Wicklow, Ireland", "description": "The view from my school, Greystones seafront, Co. Wicklow, Ireland\r\n\r\nI went to St. David's Junior and secondary school. Sitting in class looking out at this view was a beautiful distraction (and slipping out for a quick lunchtime swim a rite of passage!). I was commissioned to paint this by someone who shared the same memories and still remains my friend.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "The_view_from_my_school_Greystone_Seafront.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 17, "fields": {"category": 2, "name": "Until Next Time, Coolnagreina, Greystones, Co. Wicklow, Ireland", "description": "Until Next Time, Coolnagreina YWCA, Greystones, Co. Wicklow, Ireland\r\n\r\nThis view and place is all about me! Coolnagreina is a very special place, not just because it is the only wheelchair accessible accommodation in Greystones, but it is also the most wonderfully serene place, situated on the harbour in the heart of Greystones. Built in 1850, it provided safe and affordable accommodation for young women in domestic service and shop workers. Transformed to meet today's diverse needs it still remains consistent to its values. Growing up in Greystones the Y provided amazing summer fun with the CSSM, the highlight was the building of the most enormous sandcastle on the South Beach. At Coolnagreina I meet so many people from all over the world returning home to visit family and others on holidays or retreats. When I stay there and watch the sun go down between Little Sugarloaf and Kindlestown Wood I know that the sun will rise tomorrow and hopefully there will always be a 'tomorrow' for me to come home.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Until_next_time_Little_Sugarloaf_and_Kindlestown_Hill_from_Coolnagreina_Greystones.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 18, "fields": {"category": 2, "name": "Waves with Attitude, North beach Greystones Co Wicklow, Ireland", "description": "Waves with Attitude, North beach, Greystones, Co. Wicklow, Ireland\r\n\r\nWhen the new marina development started to take shape I realised that this is the view many residents would wake to, with the north beach making its presence felt and Bray Head wrapping protectively around it. I shared my painting with the estate agent selling the homes who bought greeting cards to put in the welcome pack for new home owners. The original painting was bought by a Greystones resident.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Waves_with_attitude.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 19, "fields": {"category": 4, "name": "Ardmore, Co. Waterford, Ireland, Childhood memories", "description": "Ardmore Co. Waterford - Childhood Memories - Ardmore beach, Co. Waterford, Ireland\r\n\r\nA friend commissioned me to paint this scene from a photo she sent me to celebrate her cousin's big birthday. She explained that Ardmore was her cousin's 'Greystones' - full of special moments and memories. This was my first painting of a seascape other than Greystones. It was very well received and gave me the confidence to know that once I listen to what the client wants I don't have to be there to be able to deliver.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Ardmore_childhood_memories.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 20, "fields": {"category": 2, "name": "Autumn Concerto in Sea, Greystones cove, Co. Wicklow, Ireland", "description": "Autumn Concerto in Sea - Stormy October at Greystones cove, Co. Wicklow, Ireland.\r\n\r\n\r\nOctober brings stormy days and stormy waves. Capturing the sea's force was great fun. This has proved to be a very popular painting request. Originals hang in homes in Greystones, Delgany, Dublin, America, and Germany. I used the pointallism (small dots) technique with gems to bring texture to the pebbly sand, and flicking white paint with a toothbrush makes great spray!\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Autumn_Concerto_in_Sea_Greystones_Cove.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 21, "fields": {"category": 4, "name": "Making Memories Godrevy, Cornwall, England", "description": "Making Memories, Godrevy, Cornwall, England\r\n\r\nI painted this for a couple who had holidayed with family at the end of the first lockdown. Having been away from the sea for six months, they asked me to capture all that they love - sea, surf, and sand. This painting hangs in Bristol.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Making_Memories_Godrevy_Cornwall.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 22, "fields": {"category": 4, "name": "Brighton Pier, England", "description": "Brighton Pier, England\r\n\r\nI painted this commission for someone living in London with special memories of time spent at Brighton. I used pointillism (small dots) for the sand and copper foil and paint for the rusted pillars.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Our_beginning_Brighton_beach.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 23, "fields": {"category": 4, "name": "The Octagon Glen the Downs, Co Wicklow, Ireland", "description": "The Octagon Glen the Downs, Co. Wicklow, Ireland.\r\n\r\nBack in the day The Octagon at Glen of the Downs, Co. Wicklow was part of the Bellevue estate, where it was a hunting lodge and tea room for the landed gentry. For youngsters today the ruin and magical trees keep the secrets of teenage love locked away safe and sound! I painted this for a couple who carved their love into the trees more than 40 years ago!\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "The_octagon_glen_the_downs.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 24, "fields": {"category": 4, "name": "Powerscourt Waterfall, Co Wicklow, Ireland", "description": "'Falling' - Powerscourt Waerfall, Co Wicklow, Ireland\r\n\r\nThis painting evokes wonderful childhood memories of trips to Powerscourt waterfall, Ireland's highest waterfall at 121m (398 feet). Visits came with a 'soaking' guarantee as we battled to see who could get closest to the cascading waters without getting drenched. Then further downstream jumping from granite rock to rock trying not to let a foot slip into the freezing water. Always great for a day's cycle and picnic trip.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Falling_Powerscourt_Waterfall._Co._Wicklow.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 25, "fields": {"category": 4, "name": "Fairyland at Glen of the Downs, Co Wicklow, Ireland", "description": "Fairyland at Glen of the Downs, Co, Wicklow, Ireland\r\n\r\nThere is something so magical about late autumn in the woods. My cousin took a photo of Glen of the Downs, Co. Wicklow in November, and I just had to paint it, capturing the ancient trees losing their leaves and the sunny sky above. The original painting found its home in California.\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Fairlyland_at_glen_of_the_downs_near_greystones.jpg", "sizes": [2, 3, 4]}}, {"model": "products.product", "pk": 26, "fields": {"category": 2, "name": "Stormy day at Greystones Cove, Co. Wicklow, Ireland", "description": "Stormy day at Greystones Cove, Co. Wicklow\r\n\r\nMy first triptych painting. A Facebook friend had posted a photo of this view at the cove providing the ideal challenge to paint it over three canvas panels. It wasn't dry on the canvas and someone called to my house to deliver something, saw it and bought it!\r\n\r\nPrint and card of original acrylic painting.\r\n\r\nA3 mounted print\r\nA4 mounted print\r\nA6 blank greeting card and white envelope\r\n\r\nAll copyright remains with me as the artist.", "image_url": null, "image": "Stormy_day_at_greystones_cove.jpg", "sizes": [2, 3, 4]}}]